---
kind: method
id: M:Autodesk.Revit.DB.SlabShapeCreaseArray.GetEnumerator
source: html/9ca94aae-4102-9372-5696-835febb62a35.htm
---
# Autodesk.Revit.DB.SlabShapeCreaseArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.